# Многоэтапная сборка (Multi-stage build). Это золотой стандарт DevOps. Суть в том, что мы используем один 
# "грязный" контейнер (завод) для компиляции кода, а результат переносим в чистый и легкий контейнер (магазин) для запуска.

# Используем тяжеловесный SDK (Software Development Kit). В нем есть компиляторы, инструменты и исходный код.
# Этап 1: Сборка (Тяжелый образ с инструкциями)
# Берем официальный образ от Microsoft со всеми инструментами разработчика. Даем ему имя build.
FROM mcr.microsoft.com/dotnet/sdk:9.0 AS build
# Создаем внутри контейнера папку /src и говорим: "Все дальнейшие команды выполняй в этой папке".
WORKDIR /src

# Копируем файл проекта и восстанавливаем зависимости
# Архитектурный трюк (Слои и Кэширование): Почему мы не копируем сразу весь код?
# Docker кэширует каждую строку. Скачивание пакетов (dotnet restore) — долгий процесс. 
# Если мы скопируем только .csproj и скачаем пакеты, Docker запомнит этот результат. Когда ты в будущем поменяешь строчку в 
# CarController.cs (но не добавишь новых пакетов), Docker мгновенно пропустит этот шаг, взяв его из кэша. 
# Сборка ускорится в 10 раз!
COPY ["FleetApi.csproj", "./"]
RUN dotnet restore "./FleetApi.csproj"

# Копируем весь остальной код и собираем проект
# копируем весь остальной код и запускаем компиляцию в режиме Release (максимальная оптимизация). 
# Результат (готовые .dll файлы) мы складываем в папку /app/publish.
# /p: — это передача параметра (property) компилятору MSBuild.
# По умолчанию, когда ты собираешь приложение в новых версиях .NET, фреймворк создает не только библиотеку FleetApi.dll, 
# но и нативный исполняемый файл (на Windows это FleetApi.exe, на Linux — исполняемый бинарник FleetApi). 
# Этот файл-обертка называется AppHost.
# Файл .exe в Docker-образе не нужен, так как есть FleetApi.dll, который является кроссплатформенным, а соответственно 
# экономим память и не засоряем финальную папку.
COPY . .
RUN dotnet publish "FleetApi.csproj" -c Release -o /app/publish /p:UseAppHost=false

# Этап 2: Выполнение (Легкий образ для работы)
# Мы берем другой образ — aspnet. В нем НЕТ компилятора, НЕТ исходников. Он умеет только запускать готовый код.
# Безопасность (Attack Surface Reduction): Если хакер взломает этот контейнер, он не найдет там твоего исходного кода 
# или инструментов сборки, с помощью которых можно скомпилировать вирус. 
#К тому же этот образ весит около 200 МБ вместо 1 ГБ (как SDK).
FROM mcr.microsoft.com/dotnet/aspnet:9.0 AS final
# Создаем рабочую папку в новом чистом контейнере
WORKDIR /app

# Безопасность: В .NET 8/9 по умолчанию используется порт 8080 и не root-пользователь
# Начиная с .NET 8, Microsoft запретила запуск веб-серверов в Docker от имени суперпользователя (root). 
# А обычный пользователь в Linux не имеет права прослушивать порты ниже 1024 (например, стандартный 80). 
# Поэтому мы открываем порт 8080. EXPOSE — это просто документация для нас, что контейнер будет "слушать" этот порт.
EXPOSE 8080

# Копируем только готовые файлы из первого этапа
# Магия многоэтапной сборки. Мы говорим: "Сходи в контейнер build, возьми оттуда готовые файлы из /app/publish и положи сюда". 
# После этой строки тяжелый контейнер build уничтожается, освобождая память.
COPY --from=build /app/publish .

# Запуск приложения
# Команда, которая будет выполнена при старте контейнера. Мы просто запускаем наш скомпилированный бинарник.
ENTRYPOINT [ "dotnet", "FleetApi.dll" ]